{"pageProps":{"listing":{"id":"3b3fbfb6-8b1f-494a-8fb1-4b23c6ebf02e","title":"Mehek +919138111382","description":"My name is Mehek Isabella, I am 26 a 26-year-old girl. All the way from the beautiful country of India. I love traveling all over the world. My family and friends are also living abroad, specifically Scotland. I am a very nice/kind woman and a friendly person. I love to make friends. I always travel to many countries and I have gained a lot of friends here. I love giving good service with great body massage. With or without oil. I always stay in a fabulous 5-star hotel whenever I travel to a different city. I am well educated, and my parents raised me with good heart and treat people nicely. Because kindness is very important to us. I am a single woman, a good daughter to my family and a very responsible woman. I always help my family and our community. I always conducted a feeding program to all those poor people. I help and support some charity because i do believe that we should share the blessings we have with those who are in need. I love helping people, i am an ambassador of goodwill. I was born to help people, and by supporting my services, I was able to expand my help to others by giving them food, shelter and medical needs. Hope you always support my work and support the services that I offer because I’m not just helping myself but also extending help to poor people because a lot of people who are in need. Once again, this is Mehek, your beauty-with-a-purpose woman. An advocate of love. And a true queen who is always there to extend love in the community. Because this lady was raised with a golden heart. Hope to see you guys! I am very happy to communicate with you. You can contact me on WhatsApp, or you can call me immediately at the given number.","price":4500,"category":"Escort Agency","user_id":"54fdaf23-ffa5-4348-8317-f1ac0ccfda78","created_at":"2025-02-26T10:49:43.638508+00:00","updated_at":"2025-02-26T10:49:43.638508+00:00","state":"Dubai","telegram_id":"","zip_code":"110088","address":"Moti nagar","phone":"+91 919138111382","whatsapp":"+91 919138111382","email":"","website":"","profile_image":"https://res.cloudinary.com/dmbabahte/image/upload/f_webp,q_auto:eco/v1740566980/vmhcq5yypk3upfgb7uae.webp","additional_images":["https://res.cloudinary.com/dmbabahte/image/upload/f_webp,q_auto:eco/v1740566981/ghlwzceegfbzaeot42jb.webp","https://res.cloudinary.com/dmbabahte/image/upload/f_webp,q_auto:eco/v1740566982/afsyjy6mxbnk9tn2sxt2.webp"],"service_classic_vaginal_sex":false,"service_erotic_massage":false,"service_masturbation":false,"service_cum_in_face":false,"service_with_two_men":false,"service_cum_on_body":false,"service_handjob":false,"service_oral_without_condom":false,"service_duo_with_girl":false,"service_dirty_talk":false,"service_kamasutra":false,"service_position_69":false,"service_golden_shower_give":false,"service_drink":false,"status":"pending","payment_plan":"free"}},"__N_SSG":true}